/* 
    String.prototype.split(separator, [limit])  按照正则规则分割字符串，返回一个由分割后的各个部分组成的数组。
    注意：
    该方法接受两个参数，第一个参数是正则表达式，表示分隔规则，第二个参数是返回数组的最大成员数。

*/

// 1.非正则分隔
"a,  b,c, d".split(",");
// [ 'a', '  b', 'c', ' d' ]

// 2.正则分隔，去除子字符串的逗号后面的空格
var str2 = "a,     b,c, d".split(/, */);
console.log(str2);
// [ 'a', 'b', 'c', 'd' ]

// 3.指定返回数组的最大成员
"a,  b,c, d".split(/, */, 2);
//[ 'a', 'b' ]

// 4.其他示例
// 例一
"aaa*a*".split(/a*/);
// [ '', '*', '*' ]

// 例二  0个a相当于空字符'',所以会导致所以字符都被分割
"aaa**a*".split(/a*/);
// ["", "*", "*", "*"]

var str3 = "abcdef".split(/m*/);
console.log(str3);
//[ 'a', 'b', 'c', 'd', 'e', 'f' ]

// 5.如果正则表达式带有括号，则括号匹配的部分也会作为数组成员返回。
var str3 = "aaa**a*".split(/(a*)/);
console.log(str3);
// [ '', 'aaa', '*','','*', 'a', '*' ]
